zouxiaobang/ai_manager/firmware-ai-dog/sdkconfig.defaults.esp32s3
# ESP32-S3：kyle-s3-lcd（16MB Flash，8MB Octal PSRAM，ST7789 + 触摸）
# 注意：flash 用标准 QIO（Quad），只有 PSRAM 用 Octal。切勿设置 ESPTOOLPY_OCT_FLASH，
# 否则 bootloader 按 OPI 8线调优 flash 时序会失败，导致 MSPI tuning fail + 看门狗重启。
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOARD_KYLE_S3_LCD=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# K3 真机验证：启动后播正弦 + 打印麦克风电平；K6 音频流水线接入后置 n
CONFIG_AUDIO_SELFTEST=y
